
%% 初始化
q0_d=0;    %期望姿态角
q0=0.3;    %初始姿态角   
dq0=0 ;      %初始姿态角速度

qm_d=[0,0,0,0].';   %期望关节角度
qm=[0.1,0.15,0.25,0.3].';     %初始关节角度
dqm=[0,0,0,0].';         %初始关节角速度




%% 末端空载，绳索力无约束

% %航天器PD参数
% Kpbf=5;
% Kdbf=5;
% %航天器PI参数
% Kpbc=5;
% Kibc=0.5;
% %机械臂PD参数
% Kpmf=diag([5,5,5,3],0);
% Kdmf=diag([5,5,5,3],0);
% %机械臂PI参数
% Kpmc=diag([2,2,2,2],0);
% Kimc=diag([0.6,0.5,0.4,0.5],0);

%% 末端负载，绳索力无约束

% %航天器PD参数
% Kpbf=200;
% Kdbf=180;
% %航天器PI参数
% Kpbc=200;
% Kibc=0.5;
% %机械臂PD参数
% Kpmf=diag([200,200,200,200],0);
% Kdmf=diag([180,180,180,180],0);
% %机械臂PI参数
% Kpmc=diag([200,200,200,200],0);
% Kimc=diag([0.6,0.5,0.4,0.5],0);

%% 末端空载，绳索力受限（0~1000）N

% %航天器PD参数
% Kpbf=1;
% Kdbf=1;
% %航天器PI参数
% Kpbc=1;
% Kibc=0.05;
% %机械臂PD参数
% Kpmf=diag([1,1,1,1],0);
% Kdmf=diag([15,15,15,15],0);
% 
% %机械臂PI参数
% Kpmc=diag([20,20,20,20],0);
% Kimc=diag([0.05,0.05,0.05,0.05],0);

%% 末端空载，轨迹跟踪，绳索力不约束

% %航天器PD参数
% Kpbf=100;
% Kibf=1;
% Kdbf=10;
% 
% 
% %航天器PI参数
% Kpbc=1;
% Kibc=0.5;
% %机械臂PID参数
% Kpmf=diag([50,50,50,50],0);
% Kdmf=diag([5,5,5,5],0);
% Kimf=diag([1,1,1,1],0);
% %机械臂PI参数
% Kpmc=diag([20,20,20,20],0);
% Kimc=diag([0.5,0.5,0.5,0.5],0);


%% 末端空载，轨迹跟踪，绳索力受控制


% %航天器PID参数
% Kpbf=1;
% Kibf=0.1;
% Kdbf=5;
% %航天器PI参数
% Kpbc=1;
% Kibc=0.5;  ones
% %机械臂PID参数
% Kpmf=diag([0.1,0.1,0.1,0.1]); 
% Kdmf=diag([5,5,5,5]);
% Kimf=diag([0.01,0.01,0.01,0.01]);
% %机械臂PI参数
% Kpmc=diag([1,1,1,1]);
% Kimc=diag([0.5,0.5,0.5,0.5]);
% %绳索力PID参数
% Kpf=diag([0.1,0.1,0.1,0.1,0.1,0.1,0.1,0.1]);
% Kif=diag([0.01,0.01,0.01,0.01,0.01,0.01,0.01,0.01]);
% Kdf=diag([10,10,10,10,10,10,10,10]);

% %航天器PID参数
% Kpbf=0.001;
% Kibf=0.05;
% Kdbf=0.01;
% %航天器PI参数
% Kpbc=0.001;
% Kibc=0.05;  
% %机械臂PID参数
% Kpmf=diag(0.001*ones(4,1)); 
% Kimf=diag(0.05*ones(4,1));
% Kdmf=diag(0.01*ones(4,1));
% %机械臂PI参数
% Kpmc=diag(0.001*ones(4,1));
% Kimc=diag(0.05*ones(4,1));
% %绳索力PID参数
% Kpf=diag(0.001*ones(8,1));
% Kif=diag(0.05*ones(8,1));
% Kdf=diag(0.01*ones(8,1));


%% 

% %航天器PD参数
% Kpbf=1;
% Kdbf=1;
% %航天器PI参数
% Kpbc=1;
% Kibc=0.05;
% %机械臂PD参数
% Kpmf=diag([1,1,1,1],0);
% Kdmf=diag([15,15,15,15],0);
% 
% %机械臂PI参数
% Kpmc=diag([20,20,20,20],0);
% Kimc=diag([0.05,0.05,0.05,0.05],0);
% 
% %绳索力PID参数
% Kpf=diag(1*ones(8,1));
% Kif=diag(0*ones(8,1));


% Kdf=diag(0*ones(8,1));


%% 

% %航天器PD参数
% Kpbf=0.1;
% Kdbf=5;
% %航天器PI参数
% Kpbc=1;
% Kibc=0.5;
% %机械臂PD参数
% Kpmf=diag([0.1,0.1,0.1,0.1],0);
% Kimf=diag([2,2,2,2],0);
% Kdmf=diag([2,2,2,2],0);
% 
% %机械臂PI参数
% Kpmc=diag([2,2,2,2],0);
% Kimc=diag([0.6,0.5,0.4,0.5],0);

%% 动态轨迹

%航天器PD参数
Kpbf=10;
Kdbf=5;
Kibf=1;
%航天器PI参数
Kpbc=1;
Kibc=1;
%机械臂PD参数
Kpmf=diag([1,1,1,1]);
Kdmf=diag([10,15,10,15]);
Kimf=diag([2,2,2,2]);


%机械臂PI参数
Kpmc=diag([1,1,1,1]);
Kimc=diag([1,1,1,1]);



