
%% 航天器控制部分参数
Phi_b_d=[0.2,0.1,0.3].';    % 航天器的期望姿态角
Phi_b=[0.8,-0.6,0.5].';     % 航天器的初始姿态角
d_Phi_b=[0,0,0].';          % 航天器初始姿态角速度

%  h_m_d=[2,0.8,0.9,0.5]';

%航天器控制部分PD参数
Kpbf=diag([3.2,3.4,5.2],0);
Kdbf=diag([1.2,2.1,1.5],0);
%航天器控制部分PI参数
Kpbc=-diag([5,5,4.8],0);
Kibc=diag([1.1,1.3,1.5],0);

% 中心航天器质量矩阵
%M_w(3X3)
M_w=[6891,0,0;
     0,12820,0;
     0,0,12820];

%% 耦合惯性矩阵
%M_wm(3,4);
M_wm=[10,0,0,0;
      0,10,0,0;
      0,0,0,10];

M_mw=M_wm';

H_b=[1.2,0,-0.3;1,0.89,0.24;0.36,0,0.21];

%% 机械臂部分参数设置
theta_m_d=[0.3,0.4,0.5,0.6].';   % 机械臂期望关节角度
theta_m=[1.5,0.7,1.0,2.3].';     % 机械臂初始关节角度
d_theta_m=[0,0,0,0].';           % 机械臂初始关节角速度


%机械臂控制部分PD参数
Kpmf=diag([4,3,6,5],0);
Kdmf=diag([0.65,0.89,0.99,1.2],0);
 %机械臂控制部分PI参数
Kpmc=-diag([5.2,4.3,6.5,4.8],0);
Kimc=diag([0.88,0.86,0.75,0.89],0);

%机械臂质量矩阵
%M_m(4X4)
M_m=[3.125,0,0,0;
     0,22500,0,0;
     0,0,22500,0;
     0,0,0,180];


