
% t=0:0.1:10;
% Phi_b_d=[sin(t);cos(t);sin(t).*cos(t)];
% theta_m_d=[cos(t);sin(t);sin(t)./cos(t);sin(t).*cos(t)];

%% 航天器控制部分参数

Phi_b_d=[0.2,0.1,0.3].';    %期望姿态角
Phi_b=[0.8,-0.6,0.5].';     %初始姿态角
d_Phi_b=[0,0,0].';          %初始姿态角速度
% dd_Phi_b=[0,0,0].';          %初始姿态角加速度

%航天器控制部分PD参数
Kpbf=diag([5,5.1,5.2],0);
Kdbf=diag([5,4,4],0);
%航天器控制部分PI参数
Kpbc=diag([5.33,4.2,5.1],0);
Kibc=diag([0.9,0.96,1.2],0);


%% 姿态变化矩阵
H_b=[1.2,0,-0.3;1,0.89,0.24;0.36,0,0.21];      %暂且先设置为常值

%% 机械臂部分参数设置
theta_m_d=[0.3,0.4,0.5,0.6].';   %期望关节角度
theta_m=[1.5,0.7,1.0,2.3].';     %初始关节角度
d_theta_m=[0,0,0,0].';           %初始关节角速度
% dd_theta_m=[0,0,0,0].';           %初始关节角加速度


%机械臂控制部分PD参数
Kpmf=diag([4,3,2,2],0);
Kdmf=diag([2,2.3,2.5,2.5],0);
 %机械臂控制部分PI参数
Kpmc=diag([5.1,5.5,5.1,5.4],0);
Kimc=diag([0.9,0.89,0.98,0.9],0);